Autodesk.Revit.DB.FilteredElementCollector.IsViewValidForElementIteration(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies if the particular element is valid for iteration of drawn elements.
Remarks:
Views that have no way of representing drawn elements, such as many view templates, fail this check.
document:
The document.
viewId:
The view id.
Returns:
True if the element is valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.Excluding(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Applies an ExclusionFilter to the collector.
Remarks:
Elements passed to this filter will be automatically excluded from the results.
If you have an active iterator to this collector it will be stopped by this call.
idsToExclude:
The ids to exclude from the results.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input collection of ids was empty, or its contents were not valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.ContainedInDesignOption(Autodesk.Revit.DB.ElementId)
Applies an ElementDesignOptionFilter to the collector.
Remarks:
Only elements that are contained by this particular design option will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
designOptionId:
The design option id.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.OwnedByView(Autodesk.Revit.DB.ElementId)
Applies an ElementOwnerViewFilter to the collector.
Remarks:
Only elements that are owned by this particular view will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
viewId:
The view id of the owner view.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.OfCategoryId(Autodesk.Revit.DB.ElementId)
Applies an ElementCategoryFilter to the collector.
Remarks:
Only elements of this category id will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
categoryId:
The category id.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.OfClass(System.Type)
Applies an ElementClassFilter to the collector.
Remarks:
Only elements whose class is an exact match to the input class,
or elements whose type is derived from the input class will pass the collector.
There is a small subset of Element subclasses in the API that are not supported
by this filter.  These classes exist in the API, but not in Revit's native object model,
which means that this filter doesn't support them.  In order to use a class filter to
find elements of these types, it is necessary to use a higher level class and then
process the results further to find elements matching only the subclass. For a list
of subclasses affected by this restriction, consult the documentation for ElementClassFilter.
If you have an active iterator to this collector it will be stopped by this call.
type:
The element type.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input type is not a subclass of Element.
-or-
The input type is of an element type that exists in the API, but not in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.UnionWith(Autodesk.Revit.DB.FilteredElementCollector)
Unites the set of elements passing the filter in this collector
with the set of elements passing the filter in another collector.
Remarks:
The result will be the same as using a LogicalOrFilter to connect this filter with another.
If you have an active iterator to this collector it will be stopped by this call.
other:
The other collector
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.IntersectWith(Autodesk.Revit.DB.FilteredElementCollector)
Intersects the set of elements passing the filter in this collector
with the set of elements passing the filter in another collector.
Remarks:
The result will be the same as using a LogicalAndFilter to connect this filter with another.
If you have an active iterator to this collector it will be stopped by this call.
other:
The other collector
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.WherePasses(Autodesk.Revit.DB.ElementFilter)
Applies an element filter to the collector.
Remarks:
The filter will be added as an additional condition that all filtered elements must pass.
If you have an active iterator to this collector it will be stopped by this call.
filter:
The element filter.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Constructs a new FilteredElementCollector that will search and filter the visible elements from
a Revit link in a host document view.
Remarks:
Only visible elements belonging to the link instance will be returned. Other instances of
that link may have different element visibility in a given view.
Elements that will be passed by the collector have graphics that may be visible in
the input view. Some elements may still be hidden because they are obscured by other elements.
For elements which are outside of a crop region, they may still be passed by the collector because
Revit relies on later processing to eliminate the elements hidden by the crop.
This effect may more easily occur for non-rectangular crop regions, but may also happen even for rectangular crops.
You can compare the boundary of the region with the element's boundary if more precise results are required.
Accessing these visible elements may require Revit to rebuild the geometry of the view.
The first time your code constructs a collector for a given view, or the first time
your code constructs a collector for a view whose display settings have just been changed,
you may experience a significant performance degradation.
hostDocument:
The document that owns the view.
viewId:
The view id in the host document.
linkId:
The Revit link instance id in the host document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
linkId does not refer to a valid link document.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FilteredElementCollector.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a new FilteredElementCollector that will search and filter the visible elements in a view.
Remarks:
Elements that will be passed by the collector have graphics that may be visible in
the input view. Some elements may still be hidden because they are obscured by other elements.
For elements which are outside of a crop region, they may still be passed by the collector because
Revit relies on later processing to eliminate the elements hidden by the crop.
This effect may more easily occur for non-rectangular crop regions, but may also happen even for rectangular crops.
You can compare the boundary of the region with the element's boundary if more precise results are required.
Accessing these visible elements may require Revit to rebuild the geometry of the view.
The first time your code constructs a collector for a given view, or the first time
your code constructs a collector for a view whose display settings have just been changed,
you may experience a significant performance degradation.
document:
The document that owns the view.
viewId:
The view id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.#ctor(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Constructs a new FilteredElementCollector that will search and filter a specified set of elements.
document:
The document that owns the elements matching the element ids.
elementIds:
The input set of element ids.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input collection of ids was empty, or its contents were not valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.#ctor(Autodesk.Revit.DB.Document)
Constructs a new FilteredElementCollector that will search and filter the set of elements in a document.
document:
The document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011